/*废案*/
/*// 定义虚拟数据的类型
interface SlideData {
    id: string;
    url: string;
    image: string;
    alt: string;
    content: string[];
}

/!*!// 定义虚拟数据
const slidesData: SlideData[] = [
    {
        id: "127515",
        url: "/main/news/detail/127515",
        image: "https://fastcdn.mihoyo.com/content-v2/hk4e/127827/beefdc787efbe11ebf59adcda4983e9d_3405584647452393570.jpg",
        alt: "图1",
        content:'内容1',
        timestamp: new Date().toISOString()
    },
    {
        id: "127773",
        url: "/main/news/detail/127773",
        image: "https://fastcdn.mihoyo.com/content-v2/hk4e/127830/fceeb5c3b0de2791836a37ff8753b8a3_6020254494486414138.jpg",
        alt: "图2",
        content:'内容1',
        timestamp: new Date().toISOString()
    },
    {
        id: "127699",
        url: "/main/news/detail/127699",
        image: "https://fastcdn.mihoyo.com/content-v2/hk4e/127829/7c0657c77130d5ce52bd9d4bdaf2a4ad_975736290156877350.jpg",
        alt: "图3",
        content:'内容1',
        timestamp: new Date().toISOString()
    },
    {
        id: "127563",
        url: "/main/news/detail/127563",
        image: "https://fastcdn.mihoyo.com/content-v2/hk4e/127828/7b1e36fd8b98b494dcb0fafef603af85_4491787042756208976.jpg",
        alt: "图4",
        content:'内容1',
        timestamp: new Date().toISOString()
    }
];*!/

// 定义虚拟数据
const slidesData: SlideData[] = [
    {
        id: "127515",
        url: "/main/news/detail/127515",
        image: "https://fastcdn.mihoyo.com/content-v2/hk4e/127827/beefdc787efbe11ebf59adcda4983e9d_3405584647452393570.jpg",
        alt: "图1",
        content: [
            "亲爱的旅行者：",
            "以下是5.4版本——「梦间见月明」更新与补偿内容。",
            "〓补偿内容〓",
            "停服更新补偿：原石*300（停服维护每小时补偿60原石）",
            "问题修复补偿：原石*300（补偿条目请参考对应补偿邮件）",
            "〓补偿范围〓",
            "停服更新补偿：2025/02/12 06:00前冒险等阶达到5级及以上的旅行者。",
            "领取时间截至5.4版本结束前。",
            "问题修复补偿：2025/02/12 06:00前冒险等阶达到5级及以上的旅行者。",
            "请旅行者于2025/02/15 06:00前上线收取邮件。",
            "制作组将在维护完成后5小时内，以游戏内邮件的形式，向旅行者发放相应补偿。邮件有效期为30天，请及时领取附件。",
            "〓更新时间〓",
            "2025/02/12 06:00开始，预计5个小时完成。",
            "〓客户端更新方式〓",
            "PC：关闭当前游戏后，重新打开启动器，点击更新；",
            "iOS：进入App Store，点击更新；",
            "安卓：进入游戏后，按照游戏内弹窗提示完成更新；",
            "PS5™或PS4™：打开系统界面-选择《原神》-按下手柄OPTIONS键-选择确认升级；",
            "若遇到任何安装问题，请联系客服，我们将为旅行者解决问题。"
        ]
    },
    {
        id: "127773",
        url: "/main/news/detail/127773",
        image: "https://fastcdn.mihoyo.com/content-v2/hk4e/127830/fceeb5c3b0de2791836a37ff8753b8a3_6020254494486414138.jpg",
        alt: "图2",
        content: [
            "亲爱的旅行者：",
            "以下是5.4版本——「梦间见月明」更新与补偿内容。",
            "〓补偿内容〓",
            "停服更新补偿：原石*300（停服维护每小时补偿60原石）",
            "问题修复补偿：原石*300（补偿条目请参考对应补偿邮件）",
            "〓补偿范围〓",
            "停服更新补偿：2025/02/12 06:00前冒险等阶达到5级及以上的旅行者。",
            "领取时间截至5.4版本结束前。",
            "问题修复补偿：2025/02/12 06:00前冒险等阶达到5级及以上的旅行者。",
            "请旅行者于2025/02/15 06:00前上线收取邮件。",
            "制作组将在维护完成后5小时内，以游戏内邮件的形式，向旅行者发放相应补偿。邮件有效期为30天，请及时领取附件。",
            "〓更新时间〓",
            "2025/02/12 06:00开始，预计5个小时完成。",
            "〓客户端更新方式〓",
            "PC：关闭当前游戏后，重新打开启动器，点击更新；",
            "iOS：进入App Store，点击更新；",
            "安卓：进入游戏后，按照游戏内弹窗提示完成更新；",
            "PS5™或PS4™：打开系统界面-选择《原神》-按下手柄OPTIONS键-选择确认升级；",
            "若遇到任何安装问题，请联系客服，我们将为旅行者解决问题。"
        ]
    },
    {
        id: "127699",
        url: "/main/news/detail/127699",
        image: "https://fastcdn.mihoyo.com/content-v2/hk4e/127829/7c0657c77130d5ce52bd9d4bdaf2a4ad_975736290156877350.jpg",
        alt: "图3",
        content: [
            "亲爱的旅行者：",
            "以下是5.4版本——「梦间见月明」更新与补偿内容。",
            "〓补偿内容〓",
            "停服更新补偿：原石*300（停服维护每小时补偿60原石）",
            "问题修复补偿：原石*300（补偿条目请参考对应补偿邮件）",
            "〓补偿范围〓",
            "停服更新补偿：2025/02/12 06:00前冒险等阶达到5级及以上的旅行者。",
            "领取时间截至5.4版本结束前。",
            "问题修复补偿：2025/02/12 06:00前冒险等阶达到5级及以上的旅行者。",
            "请旅行者于2025/02/15 06:00前上线收取邮件。",
            "制作组将在维护完成后5小时内，以游戏内邮件的形式，向旅行者发放相应补偿。邮件有效期为30天，请及时领取附件。",
            "〓更新时间〓",
            "2025/02/12 06:00开始，预计5个小时完成。",
            "〓客户端更新方式〓",
            "PC：关闭当前游戏后，重新打开启动器，点击更新；",
            "iOS：进入App Store，点击更新；",
            "安卓：进入游戏后，按照游戏内弹窗提示完成更新；",
            "PS5™或PS4™：打开系统界面-选择《原神》-按下手柄OPTIONS键-选择确认升级；",
            "若遇到任何安装问题，请联系客服，我们将为旅行者解决问题。"
        ]
    },
    {
        id: "127563",
        url: "/main/news/detail/127563",
        image: "https://fastcdn.mihoyo.com/content-v2/hk4e/127828/7b1e36fd8b98b494dcb0fafef603af85_4491787042756208976.jpg",
        alt: "图4",
        content: [
            "亲爱的旅行者：",
            "以下是5.4版本——「梦间见月明」更新与补偿内容。",
            "〓补偿内容〓",
            "停服更新补偿：原石*300（停服维护每小时补偿60原石）",
            "问题修复补偿：原石*300（补偿条目请参考对应补偿邮件）",
            "〓补偿范围〓",
            "停服更新补偿：2025/02/12 06:00前冒险等阶达到5级及以上的旅行者。",
            "领取时间截至5.4版本结束前。",
            "问题修复补偿：2025/02/12 06:00前冒险等阶达到5级及以上的旅行者。",
            "请旅行者于2025/02/15 06:00前上线收取邮件。",
            "制作组将在维护完成后5小时内，以游戏内邮件的形式，向旅行者发放相应补偿。邮件有效期为30天，请及时领取附件。",
            "〓更新时间〓",
            "2025/02/12 06:00开始，预计5个小时完成。",
            "〓客户端更新方式〓",
            "PC：关闭当前游戏后，重新打开启动器，点击更新；",
            "iOS：进入App Store，点击更新；",
            "安卓：进入游戏后，按照游戏内弹窗提示完成更新；",
            "PS5™或PS4™：打开系统界面-选择《原神》-按下手柄OPTIONS键-选择确认升级；",
            "若遇到任何安装问题，请联系客服，我们将为旅行者解决问题。"
        ]
    }
];*/


import {SlideData, TabsDate} from "@/types";

/*Detail*//*轮播*/
const slidesData: SlideData[] = [
    {
        id: "127515",
        url: "/main/news/detail/127515",
        image: "https://fastcdn.mihoyo.com/content-v2/hk4e/127827/beefdc787efbe11ebf59adcda4983e9d_3405584647452393570.jpg",
        alt: "图1",
        content: [
            "亲爱的旅行者：",
            "以下是5.4版本——「梦间见月明」更新与补偿内容。",
            { type: 'placeholder' },
            "〓补偿内容〓",
            "停服更新补偿：原石*300（停服维护每小时补偿60原石）",
            { type: 'placeholder' },
            "问题修复补偿：原石*300（补偿条目请参考对应补偿邮件）",
            "〓补偿范围〓",
            "停服更新补偿：2025/02/12 06:00前冒险等阶达到5级及以上的旅行者。",
            { type: 'placeholder' },
            "领取时间截至5.4版本结束前。",
            "问题修复补偿：2025/02/12 06:00前冒险等阶达到5级及以上的旅行者。",
            "请旅行者于2025/02/15 06:00前上线收取邮件。",
            { type: 'placeholder' },
            "制作组将在维护完成后5小时内，以游戏内邮件的形式，向旅行者发放相应补偿。邮件有效期为30天，请及时领取附件。",
            "〓更新时间〓",
            "2025/02/12 06:00开始，预计5个小时完成。",
            { type: 'placeholder' },
            "〓客户端更新方式〓",
            "PC：关闭当前游戏后，重新打开启动器，点击更新；",
            "iOS：进入App Store，点击更新；",
            "安卓：进入游戏后，按照游戏内弹窗提示完成更新；",
            "PS5™或PS4™：打开系统界面-选择《原神》-按下手柄OPTIONS键-选择确认升级；",
            "若遇到任何安装问题，请联系客服，我们将为旅行者解决问题。"
        ],
        timestamp: new Date().toISOString()
    },
    {
        id: "127773",
        url: "/main/news/detail/127773",
        image: "https://fastcdn.mihoyo.com/content-v2/hk4e/127830/fceeb5c3b0de2791836a37ff8753b8a3_6020254494486414138.jpg",
        alt: "图2",
        content: [
            "亲爱的旅行者：",
            "以下是5.4版本——「梦间见月明」更新与补偿内容。",
            { type: 'placeholder' },
            "〓补偿内容〓",
            "停服更新补偿：原石*300（停服维护每小时补偿60原石）",
            { type: 'placeholder' },
            "问题修复补偿：原石*300（补偿条目请参考对应补偿邮件）",
            "〓补偿范围〓",
            "停服更新补偿：2025/02/12 06:00前冒险等阶达到5级及以上的旅行者。",
            { type: 'placeholder' },
            "领取时间截至5.4版本结束前。",
            "问题修复补偿：2025/02/12 06:00前冒险等阶达到5级及以上的旅行者。",
            "请旅行者于2025/02/15 06:00前上线收取邮件。",
            { type: 'placeholder' },
            "制作组将在维护完成后5小时内，以游戏内邮件的形式，向旅行者发放相应补偿。邮件有效期为30天，请及时领取附件。",
            "〓更新时间〓",
            "2025/02/12 06:00开始，预计5个小时完成。",
            { type: 'placeholder' },
            "〓客户端更新方式〓",
            "PC：关闭当前游戏后，重新打开启动器，点击更新；",
            "iOS：进入App Store，点击更新；",
            "安卓：进入游戏后，按照游戏内弹窗提示完成更新；",
            "PS5™或PS4™：打开系统界面-选择《原神》-按下手柄OPTIONS键-选择确认升级；",
            "若遇到任何安装问题，请联系客服，我们将为旅行者解决问题。"
        ],
        timestamp: new Date().toISOString()
    },
    {
        id: "127699",
        url: "/main/news/detail/127699",
        image: "https://fastcdn.mihoyo.com/content-v2/hk4e/127829/7c0657c77130d5ce52bd9d4bdaf2a4ad_975736290156877350.jpg",
        alt: "图3",
        content: [
            "亲爱的旅行者：",
            "以下是5.4版本——「梦间见月明」更新与补偿内容。",
            { type: 'placeholder' },
            "〓补偿内容〓",
            "停服更新补偿：原石*300（停服维护每小时补偿60原石）",
            { type: 'placeholder' },
            "问题修复补偿：原石*300（补偿条目请参考对应补偿邮件）",
            "〓补偿范围〓",
            "停服更新补偿：2025/02/12 06:00前冒险等阶达到5级及以上的旅行者。",
            { type: 'placeholder' },
            "领取时间截至5.4版本结束前。",
            "问题修复补偿：2025/02/12 06:00前冒险等阶达到5级及以上的旅行者。",
            "请旅行者于2025/02/15 06:00前上线收取邮件。",
            { type: 'placeholder' },
            "制作组将在维护完成后5小时内，以游戏内邮件的形式，向旅行者发放相应补偿。邮件有效期为30天，请及时领取附件。",
            "〓更新时间〓",
            "2025/02/12 06:00开始，预计5个小时完成。",
            { type: 'placeholder' },
            "〓客户端更新方式〓",
            "PC：关闭当前游戏后，重新打开启动器，点击更新；",
            "iOS：进入App Store，点击更新；",
            "安卓：进入游戏后，按照游戏内弹窗提示完成更新；",
            "PS5™或PS4™：打开系统界面-选择《原神》-按下手柄OPTIONS键-选择确认升级；",
            "若遇到任何安装问题，请联系客服，我们将为旅行者解决问题。"
        ],
        timestamp: new Date().toISOString()
    },
    {
        id: "127563",
        url: "/main/news/detail/127563",
        image: "https://fastcdn.mihoyo.com/content-v2/hk4e/127828/7b1e36fd8b98b494dcb0fafef603af85_4491787042756208976.jpg",
        alt: "图4",
        content: [
            "亲爱的旅行者：",
            "以下是5.4版本——「梦间见月明」更新与补偿内容。",
            { type: 'placeholder' },
            "〓补偿内容〓",
            "停服更新补偿：原石*300（停服维护每小时补偿60原石）",
            { type: 'placeholder' },
            "问题修复补偿：原石*300（补偿条目请参考对应补偿邮件）",
            "〓补偿范围〓",
            "停服更新补偿：2025/02/12 06:00前冒险等阶达到5级及以上的旅行者。",
            { type: 'placeholder' },
            "领取时间截至5.4版本结束前。",
            "问题修复补偿：2025/02/12 06:00前冒险等阶达到5级及以上的旅行者。",
            "请旅行者于2025/02/15 06:00前上线收取邮件。",
            { type: 'placeholder' },
            "制作组将在维护完成后5小时内，以游戏内邮件的形式，向旅行者发放相应补偿。邮件有效期为30天，请及时领取附件。",
            "〓更新时间〓",
            "2025/02/12 06:00开始，预计5个小时完成。",
            { type: 'placeholder' },
            "〓客户端更新方式〓",
            "PC：关闭当前游戏后，重新打开启动器，点击更新；",
            "iOS：进入App Store，点击更新；",
            "安卓：进入游戏后，按照游戏内弹窗提示完成更新；",
            "PS5™或PS4™：打开系统界面-选择《原神》-按下手柄OPTIONS键-选择确认升级；",
            "若遇到任何安装问题，请联系客服，我们将为旅行者解决问题。"
        ],
        timestamp: new Date().toISOString()
    }
];


/*Tabs*/
const tabsData: TabsDate[] = [
    {
        number: 719,
        label: '最新',
        items: [
            { content: '最新内容1',path:"/main/news/detail/127515", timestamp: new Date().toISOString() },
            { content: '最新内容2',path:'/', timestamp: null }, // 时间为空
        ]
    },
    {
        number: 720,
        label: '新闻',
        items: [
            { content: '新闻内容1',path:'/main/news/detail/127773', timestamp: new Date().toISOString() },
        ]
    },
    {
        number: 721,
        label: '公告',
        items: [
            { content: '《原神》「神铸赋形」活动祈愿现已开启，「长柄武器·赤月之形」「单手剑·赦罪」概率UP！',path:'/main/news/detail/127699', timestamp: new Date().toISOString() },
        ]
    },
    {
        number: 722,
        label: '活动',
        items: [
            { content: '活动内容1',path:'/main/news/detail/127563', timestamp: new Date().toISOString() },
        ]
    }
];




export  {
    slidesData,
    tabsData
};
